common/models/Account.php

SELECT * FROM `au_account` WHERE `id`=443
---
  public static function getAccount($id){
      $model = Account::findOne($id);