common/models/Category.php

   public static function getDetailCategory($id){
          $model = Category::findOne($id);
---
SELECT * FROM `au_category` WHERE `id`=37