common/models/Review.php

public static function getLastReview($limit=5,$orderby='id desc',$fields=''){
        $lang = Yii::$app->language;
        $sql = Review::find();
        $sql->joinWith(array('account'));
        if($fields!=''){$sql->select($fields);}
        $sql->where(Review::tableName().'.status =:status AND '.Review::tableName().'.lang =:lang',array(':status' => 1,':lang' =>$lang));
        if($limit>0) $sql->limit($limit);
        $sql->orderBy($orderby);
        $rows = $sql->all();
---
SELECT * FROM `au_account` WHERE `id` IN (443, 442, 440, 438, 437, 436, 435, 434, 433)